apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz_ioport.h
/********************************************************************************************
 * arch/mips/src/pic32mz/hardware/pic32mz_ioport.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ********************************************************************************************/

#ifndef __ARCH_MIPS_SRC_PIC32MZ_HARDWARE_PIC32MZ_IOPORT_H
#define __ARCH_MIPS_SRC_PIC32MZ_HARDWARE_PIC32MZ_IOPORT_H

/********************************************************************************************
 * Included Files
 ********************************************************************************************/

#include <nuttx/config.h>
#include <arch/pic32mz/chip.h>
#include "pic32mz_memorymap.h"

#if CHIP_NPORTS > 0

/********************************************************************************************
 * Pre-processor Definitions
 ********************************************************************************************/
/* IOPort Peripheral Offsets ****************************************************************/

#define PIC32MZ_IOPORTA                0
#define PIC32MZ_IOPORTB                1
#define PIC32MZ_IOPORTC                2
#define PIC32MZ_IOPORTD                3
#define PIC32MZ_IOPORTE                4
#define PIC32MZ_IOPORTF                5
#define PIC32MZ_IOPORTG                6
#define PIC32MZ_IOPORTH                7
#define PIC32MZ_IOPORTJ                8
#define PIC32MZ_IOPORTK                9

#define PIC32MZ_IOPORTn_OFFSET(n)      ((n)<<8)
#  define PIC32MZ_IOPORTA_OFFSET       0x0000
#  define PIC32MZ_IOPORTB_OFFSET       0x0100
#  define PIC32MZ_IOPORTC_OFFSET       0x0200
#  define PIC32MZ_IOPORTD_OFFSET       0x0300
#  define PIC32MZ_IOPORTE_OFFSET       0x0400
#  define PIC32MZ_IOPORTF_OFFSET       0x0500
#  define PIC32MZ_IOPORTG_OFFSET       0x0600
#  define PIC32MZ_IOPORTH_OFFSET       0x0700
#  define PIC32MZ_IOPORTJ_OFFSET       0x0800
#  define PIC32MZ_IOPORTK_OFFSET       0x0900

/* Register Offsets *************************************************************************/

#define PIC32MZ_IOPORT_ANSEL_OFFSET     0x0000 /* Analog select register */
#define PIC32MZ_IOPORT_ANSELCLR_OFFSET  0x0004 /* Analog select clear register */
#define PIC32MZ_IOPORT_ANSELSET_OFFSET  0x0008 /* Analog select set register */
#define PIC32MZ_IOPORT_ANSELINV_OFFSET  0x000c /* Analog select invert register */

#define PIC32MZ_IOPORT_TRIS_OFFSET      0x0010 /* Tri-state register */
#define PIC32MZ_IOPORT_TRISCLR_OFFSET   0x0014 /* Tri-state clear register */
#define PIC32MZ_IOPORT_TRISSET_OFFSET   0x0018 /* Tri-state set register */
#define PIC32MZ_IOPORT_TRISINV_OFFSET   0x001c /* Tri-state invert register */

#define PIC32MZ_IOPORT_PORT_OFFSET      0x0020 /* Port register */
#define PIC32MZ_IOPORT_PORTCLR_OFFSET   0x0024 /* Port clear register */
#define PIC32MZ_IOPORT_PORTSET_OFFSET   0x0028 /* Port set register */
#define PIC32MZ_IOPORT_PORTINV_OFFSET   0x002c /* Port invert register */

#define PIC32MZ_IOPORT_LAT_OFFSET       0x0030 /* Port data latch register */
#define PIC32MZ_IOPORT_LATCLR_OFFSET    0x0034 /* Port data latch clear register */
#define PIC32MZ_IOPORT_LATSET_OFFSET    0x0038 /* Port data latch set register */
#define PIC32MZ_IOPORT_LATINV_OFFSET    0x003c /* Port data latch invert register */

#define PIC32MZ_IOPORT_ODC_OFFSET       0x0040 /* Open drain control register */
#define PIC32MZ_IOPORT_ODCCLR_OFFSET    0x0044 /* Open drain control clear register */
#define PIC32MZ_IOPORT_ODCSET_OFFSET    0x0048 /* Open drain control set register */
#define PIC32MZ_IOPORT_ODCINV_OFFSET    0x004c /* Open drain control invert register */

#define PIC32MZ_IOPORT_CNPU_OFFSET      0x0050 /* Change Notice Pull-up register */
#define PIC32MZ_IOPORT_CNPUCLR_OFFSET   0x0054 /* Change Notice Pull-up clear register */
#define PIC32MZ_IOPORT_CNPUSET_OFFSET   0x0058 /* Change Notice Pull-up set register */
#define PIC32MZ_IOPORT_CNPUINV_OFFSET   0x005c /* Change Notice Pull-up invert register */

#define PIC32MZ_IOPORT_CNPD_OFFSET      0x0060 /* Change Notice Pull-down register */
#define PIC32MZ_IOPORT_CNPDCLR_OFFSET   0x0064 /* Change Notice Pull-down clear register */
#define PIC32MZ_IOPORT_CNPDSET_OFFSET   0x0068 /* Change Notice Pull-down set register */
#define PIC32MZ_IOPORT_CNPDINV_OFFSET   0x006c /* Change Notice Pull-down invert register */

#define PIC32MZ_IOPORT_CNCON_OFFSET     0x0070 /* Change Notice Control register */
#define PIC32MZ_IOPORT_CNCONCLR_OFFSET  0x0074 /* Change Notice Control clear register */
#define PIC32MZ_IOPORT_CNCONSET_OFFSET  0x0078 /* Change Notice Control set register */
#define PIC32MZ_IOPORT_CNCONINV_OFFSET  0x007c /* Change Notice Control invert register */

#define PIC32MZ_IOPORT_CNEN_OFFSET      0x0080 /* Change Notice Interrupt Enable register */
#define PIC32MZ_IOPORT_CNENCLR_OFFSET   0x0084 /* Change Notice Interrupt Enable clear register */
#define PIC32MZ_IOPORT_CNENSET_OFFSET   0x0088 /* Change Notice Interrupt Enable set register */
#define PIC32MZ_IOPORT_CNENINV_OFFSET   0x008c /* Change Notice Interrupt Enable invert register */

#define PIC32MZ_IOPORT_CNSTAT_OFFSET    0x0090 /* Change Notice Status register */
#define PIC32MZ_IOPORT_CNSTATCLR_OFFSET 0x0094 /* Change Notice Status clear register*/
#define PIC32MZ_IOPORT_CNSTATSET_OFFSET 0x0098 /* Change Notice Status set register */
#define PIC32MZ_IOPORT_CNSTATINV_OFFSET 0x009c /* Change Notice Status invert register */

#define PIC32MZ_IOPORT_CNNE_OFFSET      0x00a0 /* Change Notice Interrupt Enable register */
#define PIC32MZ_IOPORT_CNNECLR_OFFSET   0x00a4 /* Change Notice Interrupt Enable clear register */
#define PIC32MZ_IOPORT_CNNESET_OFFSET   0x00a8 /* Change Notice Interrupt Enable set register */
#define PIC32MZ_IOPORT_CNNEINV_OFFSET   0x00ac /* Change Notice Interrupt Enable invert register */

